name: "MnistAttentionClassifierNet"
layer {
  name: "mnist"
  type: "TwoInstanceEmbedData"
  top: "data"
  top: "label"
  top: "location_truth"
  include {
    phase: TRAIN
  }
  data_param {
    source: "examples/mnist/mnist_train_lmdb"
    batch_size: 512
    backend: LMDB
  }
}
layer {
  name: "mnist"
  type: "TwoInstanceEmbedData"
  top: "data"
  top: "label"
  top: "location_truth"
  include {
    phase: TEST
  }
  data_param {
    source: "examples/mnist/mnist_test_lmdb"
    batch_size: 512
    backend: LMDB
    repeat_inputs: 1
  }
}




layer{
  name: "data_split"
  type: "Split"
  bottom: "data"
  top: "data_context"
  top: "data_marg"
}



layer{
  name: "context"
  type: "Subnet"
  bottom: "data_context"
  top: "context_vec"
  subnet_param{
    prototxt_filename: "examples/mnist/DRAM_context.prototxt"
    force_backward: true
  }
}


layer{
  name: "predict_lstm_hidden_init"
  type: "Zero"
  top: "predict_lstm_hidden"
  zero_param{
    shape: 512
    shape: 128
  }
}

layer{
  name: "predict_lstm_cell_init"
  type: "Zero"
  top: "predict_lstm_cell"
  zero_param{
    shape: 512
    shape: 128
  }
}


layer {
  name: "guidance_hidden_init"
  type: "InnerProduct"
  bottom: "context_vec"
  top: "guidance_lstm_hidden"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 512
    weight_filler {
      type: "gaussian"
      std: 0.04
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "guidance_cell_init"
  type: "InnerProduct"
  bottom: "context_vec"
  top: "guidance_lstm_cell" 
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 512
    weight_filler {
      type: "gaussian"
      std: 0.04
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer{
  name: "unroll"
  type: "Unroll"
  bottom: "guidance_lstm_hidden"
  bottom: "guidance_lstm_cell"
  bottom: "predict_lstm_hidden"
  bottom: "predict_lstm_cell"
  bottom: "data_marg"
  top: "guidance_lstm_hidden_out"
  top: "guidance_lstm_cell_out"
  top: "predict_lstm_hidden_out"
  top: "predict_lstm_cell_out"
  top: "location_tuple_generated"
  top: "predict_output"
  top: "baseline"
  top: "reward"
  top: "curriculum_cutoff"
  unroll_param{
    num_timesteps: 8
    subnet_prototxt: "examples/mnist/DRAM_timestep.prototxt"
    recurrent_input: "guidance_lstm_hidden"
    recurrent_input: "guidance_lstm_cell"
    recurrent_input: "predict_lstm_hidden"
    recurrent_input: "predict_lstm_cell"
  }
}



layer{
  name: "reward"
  type: "Reward"
  bottom: "predict_output"
  bottom: "label" 
  bottom:  "reward"
  bottom: "curriculum_cutoff"
  top: "predict_reward_total"
  top: "predict_reward_values"
  reward_param{
    per_target_rewards: true
  }

}


layer{
  name: "baseline_euclidean_loss"
  type: "EuclideanLoss"
  bottom: "baseline"
  bottom: "predict_reward_values"
  propagate_down: true
  propagate_down: false
  top: "baseline_loss"
  loss_weight: 1
}

layer {
  name: "label_slice"
  type: "Slice"
  bottom: "label"
  top: "label_1"
  top: "label_2"
  slice_param{
    axis: 1
  }
}

layer{
  name: "tile_label_1"
  type: "Tile"
  bottom: "label_1"
  top: "label_tiled_1"
  tile_param{
    tiles: 4
  }
}

layer{
  name: "tile_label_2"
  type: "Tile"
  bottom: "label_2"
  top: "label_tiled_2"
  tile_param{
    tiles: 4
  }
}

layer{
  name: "label_concat"
  type: "Concat"
  bottom: "label_tiled_1"
  bottom: "label_tiled_2"
  top: "label_tiled"
  concat_param{
    axis: 1
  }
}

layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "predict_output"
  bottom: "label_tiled"
  propagate_down: true
  propagate_down: false
  top: "predict_loss"
  softmax_param{
    axis: 1
  }
}


layer {
  name: "silence"
  type: "Silence"
  bottom: "location_truth"
  bottom: "location_tuple_generated"
  bottom: "guidance_lstm_cell_out"
  bottom: "guidance_lstm_hidden_out"
  bottom: "predict_lstm_cell_out"
  bottom: "predict_lstm_hidden_out"
}
