name: "Generative_Adversarial_Net"
layer {
  name: "mnist"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    scale: 0.00390625
  }
  data_param {
    source: "examples/mnist/mnist_train_lmdb"
    batch_size: 128
    backend: LMDB
  }
}
layer {
  name: "mnist"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    scale: 0.00390625
  }
  data_param {
    source: "examples/mnist/mnist_test_lmdb"
    batch_size: 128
    backend: LMDB
  }
}



layer {
  name: "gen_adv"
  type: "AdversarialSubnetPair"
  bottom: "data"
  top: "generated"
  top: "discrim_score"
  top: "gen_score"

  loss_weight: 0
  loss_weight: 1
  loss_weight: 1
  adversarial_pair_param{
    subnet1_prototxt: "examples/mnist/generator_GAN.prototxt"
    subnet2_prototxt: "examples/mnist/discriminator_GAN.prototxt"
    reverse_subnet1_gradient: true
    do_data_concat: true
    subnet2_k: 1
  }
}

layer {
  name: "silence"
  type: "Silence"
  bottom: "generated"
  bottom: "label"
}
